Tekla.Structures.Drawing.Grid.GridAttributes
The GridAttributes class is the attributes class for the grid.

Tekla.Structures.Drawing.Grid.GridAttributes.Font
The grid's font attributes.

Tekla.Structures.Drawing.Grid.GridAttributes.Line
The grid's line attributes.

Tekla.Structures.Drawing.Grid.GridAttributes.Frame
The frame attributes of the grid's labels.

Tekla.Structures.Drawing.Grid.GridAttributes.DrawTextAtBottomOfGrid
Set as true if you want to show the grid's text labels at the bottom of the grid.

Tekla.Structures.Drawing.Grid.GridAttributes.DrawTextAtTopOfGrid
Set as true if you want to show the grid's text labels at the top of the grid.

Tekla.Structures.Drawing.Grid.GridAttributes.DrawTextAtLeftOfGrid
Set as true if you want to show the grid's text labels at the left of the grid.

Tekla.Structures.Drawing.Grid.GridAttributes.DrawTextAtRightOfGrid
Set as true if you want to show the grid's text labels at the right of the grid.

Tekla.Structures.Drawing.Grid.GridAttributes.DrawOnlyTextLabelsNotGrids
Set as true if you don't want to draw the grids, only show the grids' text labels.

Tekla.Structures.Drawing.Grid.GridAttributes.OffsetAtStartOfLine
The offset for the beginning of the grid lines.

Tekla.Structures.Drawing.Grid.GridAttributes.OffsetAtEndOfLine
The offset for the end of the grid lines.

Tekla.Structures.Drawing.Grid.GridAttributes.#ctor(System.Boolean)
Creates a new default grid  attributes instance that does not load standard attributes

Tekla.Structures.Drawing.Grid.GridAttributes.#ctor
Creates a new default grid attributes instance that loads standard attributes.

Tekla.Structures.Drawing.Grid.GridAttributes.#ctor(System.String)
Creates a new grid attributes instance that loads the specified attributes.
AttributesFile: The filename of the attributes file.

Tekla.Structures.Drawing.Grid.GridAttributes.LoadAttributes(System.String)
Loads the attributes from the attribute file.
AttributeFile: The filename of the attribute file.
Returns: True if the attributes are loaded correctly. False if the attribute file loading failed.

Tekla.Structures.Drawing.Grid.GridAttributes.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.